<a href="https://colab.research.google.com/github/hussain0048/Python-Notes/blob/master/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Pandas Table of Content**

1.   ðŸ“š *_[Installing Pandas](#installing_pandas)_*
2.   ðŸ“š *_[Importing Pandas](#importing_pandas)_*
3.   ðŸ“š *_[Pandas Data Structure](#pandas_data_structure)_*
4.   ðŸ“š *_[DataFrame Funtions in Pandas](#data_frame_functions)_*

#  **Pandas(Beginer Level)**

#**Section-1- Installing Pandas**

In [ ]:
conda install pandas

In [ ]:
!pip install pandas

# **Section-2-Importing Pandas**

In [ ]:
import pandas as pd
import numpy as np

# **Section-3- Pandas Data Structures**

### **3.1- Series**

In [ ]:
newSeries = pd.Series(data , index)

**Letâ€™s build a series from Python List:**

In [ ]:
mylist = ['Ahmad','Machine Learning', 20, 'Pakistan']
labels = ['Name', 'Career', 'Age', 'Country']
newSeries = pd.Series(mylist,labels)
print(newSeries)

Name                  Ahmad
Career     Machine Learning
Age                      20
Country            Pakistan
dtype: object

It is not necessary to add an index in a pandas Series. In that case, it will automatically start index from 0.

In [ ]:
mylist = ['Ahmad','Machine Learning', 20, 'Pakistan']
newSeries = pd.Series(mylist)
print(newSeries)

**Create a Series using a Python Dictionary**

In [ ]:
myDict = {'Name': 'Ahmad',
         'Career': 'Machine Learning',
         'Age': 20,
          'Country': 'Pakistan'}
mySeries = pd.Series(myDict)
print(mySeries)

Name                  Ahmad
Career     Machine Learning
Age                      20
Country            Pakistan
dtype: object

**Accessing data from Series**

In [ ]:
seriesName['IndexName']

In [ ]:
print(mySeries['Name'])
print(mySeries['Age'])
print(mySeries['Career'])

**Basic Operations on Pandas Series**

In [ ]:
newSeries = pd.Series([10,20,30,40],index=['LONDON','NEWYORK','Washington','Manchester'])
newSeries1 = pd.Series([10,20,35,46],index=['LONDON','NEWYORK','Istanbul','Karachi'])
print(newSeries,newSeries1,sep='\n\n')

Basic Arithmetic operations include +-*/ operations. These are done over-index, so letâ€™s perform them.

In [ ]:
newSeries + newSeries1

Istanbul       NaN
Karachi        NaN
LONDON        20.0
Manchester     NaN
NEWYORK       40.0
Washington     NaN
dtype: float64

Here we can see that since London and NEWYORK index are present in both Series, so it has added the value of both and output of rest is NaN (Not a number)

In [ ]:
newSeries * newSeries1

In [ ]:
newSeries / newSeries1

**Element Wise Operations/Broadcasting**

In [ ]:
newSeries + 5

LONDON        15
NEWYORK       25
Washington    35
Manchester    45
dtype: int64

In [ ]:
newSeries ** 1/2

### 3.2-**DataFrame**

**Main ways to create Data Frame are**

Python Dictionary

In [ ]:
df1 = {"Name":["Ahmad","Ali",'Ismail',"John"],"Age":  [20,21,19,17],"Height":[5.1,5.6,6.1,5.7]}

In [ ]:
df1 = pd.DataFrame(df1)
df1

     Name  Age  Height
0   Ahmad   20     5.1
1     Ali   21     5.6
2  Ismail   19     6.1
3    John   17     5.7

Getting Values from a Column

In [ ]:
df1['Age']
#df1.columnname

Both of these syntaxes are correct, but we have to be careful about choosing one. If our column name has space in it, then definitely we can not use the 2nd method. We have to use the first method. We can only use the 2nd method when there is no space in the column name.

In [ ]:
df1.Name

Values of Multiple Columns

In [ ]:
df1[["Name","Age"]]

## **Section-4-DataFrame Functions in Pandas**

In [ ]:
import seaborn as sns

df=sns.load_dataset('titanic')
import numpy as np

### **4.1-Data Importing**

In [ ]:
pd.read_fileExtensionName("File Path")

**pd.read_csv()**

In [ ]:
import pandas as pd

# Read the CSV file into a DataFrame
df = pd.read_csv('data.csv')

# Print the DataFrame
print(df)

**pd.read_table()**

In [ ]:
import pandas as pd

# Read the delimited file into a DataFrame
df = pd.read_table('data.txt', delimiter='\t')

# Print the DataFrame
print(df)

**pd.read_excel()**

In [ ]:
import pandas as pd

# Read the Excel file into a DataFrame
df = pd.read_excel('data.xlsx')

# Print the DataFrame
print(df)

**pd.readl_sql()**

In [ ]:
import pandas as pd
import sqlite3

# Create a connection to the database
conn = sqlite3.connect('my_database.db')

# Read the SQL query into a DataFrame
df = pd.read_sql('SELECT * FROM users', conn)

# Print the DataFrame
print(df)

**pd.read_json()**

In [ ]:
import pandas as pd

# Read the JSON file into a DataFrame
df = pd.read_json('data.json')

# Print the DataFrame
print(df)

### **4.2- Data Statistics**

**head()**

In [ ]:
df.head()

**tail()**

In [ ]:
df.tail(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

**shape()**

In [ ]:
df.shape()

**isnull()**

In [ ]:
df.isnull().head()

**sum()**

In [ ]:
df.isnull().sum()

**info()**

In [ ]:
df.info()

**describe()**

In [ ]:
df.describe()

**mean()**

In [ ]:
df.mean()

**median()**

In [ ]:
df.median()

**std()**

In [ ]:
df.std()

**Count()**

In [ ]:
df.count()

**Max()**

In [ ]:
df.max()

**Min()**

In [ ]:
df.min()

### **4.3- Data Cleaning**

####  **4.3.1-Handling Duplicated Value**

Check if the data has any duplicate values using duplicated(). The sum() gives you the number of duplicate rows in the data frame

In [ ]:
df.duplicated().sum()

In order to see the duplicate rows, we can store the duplicated values inside a data frame.

In [ ]:
duplicate_rows = df[df.duplicated()]
duplicate_rows

Duplicate values can be removed using drop_duplicates()

In [ ]:
data = df.drop_duplicates(ignore_index=True)
# ignore_index=True so that the index is relabeled

#### **4.3.2- Handling Null Value**

**isnull().**

In order to find the missing values in a dataset we can use isnull().

In [ ]:
df.isnull().sum().sort_values(ascending=False)
# isnull() - To find the null values
# sum() - To find the sum of null values for each attribute
# sort_values() - To sort the values

We can find the percentage of values missing using the below code

In [ ]:
(df.isnull().sum().sum()/df.size)*100

0.0074822297044519264

**dp.dropna()**

The following code drops rows that contain any missing values:

In [ ]:
df = df.dropna()

The following code drops columns that contain all missing values:

In [ ]:
df = df.dropna(axis=1, how='all')

In [ ]:
df.dropna(axis=1)

**fillna()**

The following code fills missing values with the value 0:

In [ ]:
df = df.fillna(0)

The following code fills missing values with the previous valid value:

In [ ]:
df = df.fillna(method='ffill')

**bfill()**

In [ ]:
data = df.bfill()

**ffill method**

In [ ]:
df = df.ffill()

#### **4.3.3- Data Sorting**

**df.sort_values()**

The following code sorts the DataFrame by the A column in ascending order:

In [ ]:
df.head()

In [ ]:
 df = df.sort_values('sex')

In [ ]:
df

The following code sorts the DataFrame by the B column in descending order:

In [ ]:
df = df.sort_values('sex', ascending=False)

#### **4.3.4Data Grouping**

**df.groupby()**

In [ ]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [ ]:
# applying groupby() function to
# group the data on sex value.
gk = df.groupby('sex')

In [ ]:
# Let's print the first entries
# in all the groups formed.
gk.first()

,survived,pclass,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
sex,,,,,,,,,,,,,,
female,1,1,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
male,0,3,22.0,1,0,7.2500,S,Third,man,True,E,Southampton,no,False

**df.apply()**

In [ ]:
df = pd.DataFrame({'Name':['John Doe','Jane Doe','John Smith'], 'Age':[30,25,40]})

# Remove any rows where the name is missing
df = df.apply(lambda row: row if row['Name'] else None, axis=1)

# Drop any rows that are now empty
df = df.dropna()

print(df)

         Name  Age
0    John Doe   30
1    Jane Doe   25
2  John Smith   40

#### **4.3.4- Inconsistent Data Entry**

In [ ]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,C,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,C,Southampton,no,True

In [ ]:
df['who'].unique()

array(['man', 'woman', 'child'], dtype=object)

After using the unique function, we understood that there is a Graduate and graduate present in the Education column; hence it is necessary to normalize the entire column in either lowercase or uppercase.

In [ ]:
df['who'] = df['who'].str.lower()
df['who'].unique()

array(['man', 'woman', 'child'], dtype=object)